---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions.Dispose
source: html/b4944b2f-824e-332a-159f-eddb1ba61a76.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions.Dispose Method

Releases all resources used by the EnergyAnalysisDetailModelOptions

## Syntax (C#)
```csharp
public void Dispose()
```